In [1]:
# Dependencies and Setup
import pandas as pd
from pathlib import Path

# File to Load 
interest_rate_data_to_load = Path("Resources/MORTGAGE30US.csv")
house_pricing_data_to_load = Path("Resources/Average House Pricing Q1 1973 - Q1 2023 (all regions).csv")
income_data_to_load = Path("Resources/Mean Family income 1973 - EOD 2023.csv")

# Read School and Student Data File and store into Pandas DataFrames
interest_rate_df = pd.read_csv(interest_rate_data_to_load)
house_pricing_df = pd.read_csv(house_pricing_data_to_load)
income_df = pd.read_csv(income_data_to_load)

In [2]:
#Display df(s)
interest_rate_df.head()

        DATE  MORTGAGE30US
0   1/1/1975      9.168462
1   4/1/1975      8.875385
2   7/1/1975      8.983846
3  10/1/1975      9.160769
4   1/1/1976      8.873077

In [3]:
interest_rate_df.columns

Index(['DATE', 'MORTGAGE30US'], dtype='object')

In [4]:
interest_rate_df['MORTGAGE30US'] = round(interest_rate_df['MORTGAGE30US'], 4) #Rounding interest rate column to 4 decimal 
interest_rate_df['DATE'] = pd.PeriodIndex(interest_rate_df['DATE'], freq='Q') #Convert Date to Quarter
clean_interest_rate_df = interest_rate_df.rename(columns={"MORTGAGE30US": "Fixed 30-year Rate", "DATE": "Year/Quarter"}).dropna() #change interest rate column name
clean_interest_rate_df.head()

  Year/Quarter  Fixed 30-year Rate
0       1975Q1              9.1685
1       1975Q2              8.8754
2       1975Q3              8.9838
3       1975Q4              9.1608
4       1976Q1              8.8731

In [5]:
clean_interest_rate_df.dtypes

Year/Quarter          period[Q-DEC]
Fixed 30-year Rate          float64
dtype: object

In [6]:
final_clean_interest_rate_df = clean_interest_rate_df.astype({'Year/Quarter':'str'})
final_clean_interest_rate_df.dtypes

Year/Quarter           object
Fixed 30-year Rate    float64
dtype: object

In [30]:
quarterly_interest_column_mapping={
    "Year/Quarter": "year_quarter",
    "Fixed 30-year Rate": "fixed_30_year_rate"
}

final_clean_interest_rate_df.rename(columns= quarterly_interest_column_mapping, inplace= True)

In [31]:

final_clean_interest_rate_df.to_csv("clean_data_outputs/quarterly_interest_rate.csv")

In [8]:
#Get interest rate of Q2 data for every year
annual_interest_rate_df = clean_interest_rate_df.copy()
annual_interest_rate_df.dtypes
annual_interest_rate_df['String Year/Quarter'] = annual_interest_rate_df['Year/Quarter'].astype(str)
annual_interest_rate_df.dtypes
annual_interest_rate_df['Year'] = annual_interest_rate_df['String Year/Quarter'].str.extract('(\d+)', expand=False)
dump_annual_interest_rate_df = annual_interest_rate_df.assign(Q = annual_interest_rate_df['String Year/Quarter'].str[-1].astype('int'))
clean_annual_interest_rate_df = dump_annual_interest_rate_df.loc[dump_annual_interest_rate_df['Q'] == 2].drop(columns=['Year','Q','String Year/Quarter']).reset_index(drop=True)
clean_annual_interest_rate_df.head()

  Year/Quarter  Fixed 30-year Rate
0       1975Q2              8.8754
1       1976Q2              8.7769
2       1977Q2              8.8077
3       1978Q2              9.5577
4       1979Q2             10.7638

In [9]:

final_clean_annual_interest_rate_df = clean_annual_interest_rate_df.astype({'Year/Quarter':'str'})

In [10]:
final_clean_annual_interest_rate_df.dtypes

Year/Quarter           object
Fixed 30-year Rate    float64
dtype: object

In [32]:
annual_interest_column_mapping={
    "Year/Quarter": "year_quarter",
    "Fixed 30-year Rate": "fixed_30_year_rate"
}

final_clean_annual_interest_rate_df.rename(columns= annual_interest_column_mapping, inplace= True)

In [33]:
final_clean_annual_interest_rate_df.to_csv("clean_data_outputs/annual_interest_rate.csv")

In [12]:
house_pricing_df.head()
house_pricing_df['DATE'] = pd.PeriodIndex(house_pricing_df['DATE'], freq='Q') #Convert Date to Quarter
house_pricing_df.columns

Index(['DATE', 'ASPS', 'ASPW', 'ASPUS', 'ASPNE', 'ASPMW'], dtype='object')

In [13]:
clean_house_pricing_df = house_pricing_df.rename(columns={"DATE": "Year/Quarter", "ASPS": "Southern Average Price", "ASPW": "Western Average Price", "ASPUS": "Nationwide Average Price", "ASPNE": "Northeastern Average Price", "ASPMW": "Midwestern Average Price"}).dropna() #change housing price column name
clean_house_pricing_df

,Year/Quarter,Southern Average Price,Western Average Price,Nationwide Average Price,Northeastern Average Price,Midwestern Average Price
0,1975Q1,38000.0,42300.0,40900.0,47300.0,41800.0
1,1975Q2,39800.0,43600.0,42600.0,46400.0,44000.0
2,1975Q3,39200.0,43600.0,42200.0,47400.0,42900.0
3,1975Q4,41300.0,47400.0,44400.0,47700.0,44500.0
4,1976Q1,43000.0,49200.0,46000.0,48600.0,45100.0
...,...,...,...,...,...,...
188,2022Q1,451000.0,627700.0,514100.0,766400.0,432000.0
189,2022Q2,482000.0,647300.0,527500.0,707000.0,438700.0
190,2022Q3,493000.0,669900.0,547800.0,995200.0,435300.0
191,2022Q4,502200.0,666800.0,552600.0,798800.0,403100.0
192,2023Q1,446200.0,624700.0,505300.0,825300.0,449300.0

In [14]:
clean_house_pricing_df.dtypes

Year/Quarter                  period[Q-DEC]
Southern Average Price              float64
Western Average Price               float64
Nationwide Average Price            float64
Northeastern Average Price          float64
Midwestern Average Price            float64
dtype: object

In [15]:
final_clean_house_pricing_df = clean_house_pricing_df.astype({'Southern Average Price' : 'int',
                                                              'Western Average Price' : 'int',
                                                              'Nationwide Average Price' : 'int',
                                                              'Northeastern Average Price':'int',
                                                              'Midwestern Average Price': 'int',
                                                              'Year/Quarter' : 'str'
                                                              })

In [16]:
final_clean_house_pricing_df.dtypes

Year/Quarter                  object
Southern Average Price         int32
Western Average Price          int32
Nationwide Average Price       int32
Northeastern Average Price     int32
Midwestern Average Price       int32
dtype: object

In [34]:
quarterly_housing_column_mapping={
    "Year/Quarter": "year_quarter",
    "Southern Average Price": "southern_average_price",
    "Western Average Price": "western_average_price",
    "Nationwide Average Price": "nationwide_average_price",
    "Northeastern Average Price": "northeastern_average_price",
    "Midwestern Average Price": "midwestern_average_price"
}

final_clean_house_pricing_df.rename(columns= quarterly_housing_column_mapping, inplace= True)

In [35]:
final_clean_house_pricing_df.to_csv("clean_data_outputs/quarterly_house_price.csv")

In [18]:
#Get interest rate of Q2 data for every year
annual_housing_pricing_df = clean_house_pricing_df.copy()
#annual_interest_rate_df.dtypes
annual_housing_pricing_df['String Year/Quarter'] = annual_housing_pricing_df['Year/Quarter'].astype(str)
#annual_interest_rate_df.dtypes
annual_housing_pricing_df['Year'] = annual_housing_pricing_df['String Year/Quarter'].str.extract('(\d+)', expand=False)
dump_annual_housing_pricing_df = annual_housing_pricing_df.assign(Q = annual_housing_pricing_df['String Year/Quarter'].str[-1].astype('int'))
clean_annual_housing_pricing_df = dump_annual_housing_pricing_df.loc[dump_annual_housing_pricing_df['Q'] == 2].drop(columns=['Year','Q','String Year/Quarter']).reset_index(drop=True)
clean_annual_housing_pricing_df.head()

,Year/Quarter,Southern Average Price,Western Average Price,Nationwide Average Price,Northeastern Average Price,Midwestern Average Price
0,1975Q2,39800.0,43600.0,42600.0,46400.0,44000.0
1,1976Q2,43700.0,51600.0,47800.0,48100.0,49400.0
2,1977Q2,48300.0,61200.0,54300.0,55800.0,54100.0
3,1978Q2,54800.0,69600.0,61600.0,60800.0,63400.0
4,1979Q2,64000.0,82000.0,72400.0,73400.0,75800.0

In [19]:
clean_annual_housing_pricing_df.columns

Index(['Year/Quarter', 'Southern Average Price', 'Western Average Price',
       'Nationwide Average Price', 'Northeastern Average Price',
       'Midwestern Average Price'],
      dtype='object')

In [20]:
final_clean_annual_housing_pricing_df = clean_annual_housing_pricing_df.astype({'Southern Average Price' : 'int',
                                                              'Western Average Price' : 'int',
                                                              'Nationwide Average Price' : 'int',
                                                              'Northeastern Average Price':'int',
                                                              'Midwestern Average Price': 'int',
                                                              'Year/Quarter' : 'str'
                                                              })

In [21]:
final_clean_annual_housing_pricing_df.dtypes

Year/Quarter                  object
Southern Average Price         int32
Western Average Price          int32
Nationwide Average Price       int32
Northeastern Average Price     int32
Midwestern Average Price       int32
dtype: object

In [36]:
annual_housing_column_mapping={
    "Year/Quarter": "year_quarter",
    "Southern Average Price": "southern_average_price",
    "Western Average Price": "western_average_price",
    "Nationwide Average Price": "nationwide_average_price",
    "Northeastern Average Price": "northeastern_average_price",
    "Midwestern Average Price": "midwestern_average_price"
}

final_clean_annual_housing_pricing_df.rename(columns= annual_housing_column_mapping, inplace= True)

In [38]:
final_clean_annual_housing_pricing_df.to_csv("clean_data_outputs/annual_house_price.csv")

In [23]:
income_df.head()

,DATE,MAFAINUSA646N,MAFAINUSMWA646N,MAFAINUSNEA646N,MAFAINUSSOA646N,MAFAINUSWEA646N
0,1/1/1975,15550,16130,16380,14150,16180
1,1/1/1976,16870,17770,17290,15460,17540
2,1/1/1977,18260,18830,19050,16920,18880
3,1/1/1978,20090,20690,20610,18610,21260
4,1/1/1979,22320,22900,23190,20500,23800

In [24]:
income_df.columns

Index(['DATE', 'MAFAINUSA646N', 'MAFAINUSMWA646N', 'MAFAINUSNEA646N',
       'MAFAINUSSOA646N', 'MAFAINUSWEA646N'],
      dtype='object')

In [25]:
income_df['DATE'] = pd.PeriodIndex(income_df['DATE'], freq='Q') #Convert Date to Quarter

In [26]:
clean_income_df = income_df.rename(columns={"DATE": "Year/Quarter", 
                                            "MAFAINUSA646N": "US Household Mean Income", 
                                            "MAFAINUSMWA646N": "Midwestern Household Mean Income", 
                                            "MAFAINUSNEA646N": "Northeastern Household Mean Income", 
                                            "MAFAINUSSOA646N": "Southern Household Mean Income", 
                                            "MAFAINUSWEA646N": "Western Household Mean Income"}).dropna() #change housing price column name

In [27]:
clean_income_df.columns

Index(['Year/Quarter', 'US Household Mean Income',
       'Midwestern Household Mean Income',
       'Northeastern Household Mean Income', 'Southern Household Mean Income',
       'Western Household Mean Income'],
      dtype='object')

In [28]:
final_clean_income_df = clean_income_df.astype({'US Household Mean Income' : 'int',
                                                'Midwestern Household Mean Income' : 'int',
                                                'Northeastern Household Mean Income' : 'int',
                                                'Southern Household Mean Income':'int',
                                                'Western Household Mean Income': 'int',
                                                'Year/Quarter' : 'str'
                                                              })

In [39]:
annual_income_column_mapping={
    "Year/Quarter": "year_quarter",
    "US Household Mean Income": "us_household_mean_income",
    "Midwestern Household Mean Income": "midwestern_household_mean_income",
    "Northeastern Household Mean Income": "northeastern_household_mean_income",
    "Southern Household Mean Income": "southern_household_mean_income",
    "Western Household Mean Income": "western_household_mean_income"

}

final_clean_income_df.rename(columns= annual_income_column_mapping, inplace= True)

In [40]:
final_clean_income_df.to_csv("clean_data_outputs/annual_family_income.csv")